org/file-conversion.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2020-11-26 Thu 12:01>
#+TITLE: File Conversion

JavaScript 中的 file、blob 和 base64 。

** Blob[fn:1]

Blob 对象表示一个不可变、原始数据的 _类文件对象_ ，它的数据可以按文本或二进制的格式进行读取，也可以转换成 =ReadableStream= 来用于数据操作。

Blob 表示的不一定是 JavaScript 原生格式的数据。 =File= 接口基于 Blob，继承了 blob 的功能并将其扩展，使其支持用户系统上的文件。

要从其他非 blob 对象和数据构造一个 Blob ，请使用 =Blob()= 函数；要创建一个 blob 数据的子集 blob ，请使用 =slice()= 方法；要获取用户文件系统上的文件对应的 Blob 对象，请参阅 =File= 文档。

接受 Blob 对象的 API 也被列在 =File= 文档中。

_1. Blob() 构造函数_

=Blob()= 构造函数允许通过其它对象创建 Blob 对象，比如，用字符串构建一个 blob ：

#+BEGIN_SRC js -n
  var obj = {name: 'Jack Liu'};
  var blob = new Blob([JSON.stringify(obj)], {type: 'application/json'});
#+END_SRC

_2. 使用 Blob 创建一个指向类型化数组的 URL_

#+BEGIN_SRC js -n
  var typeArray = GetTheTypedArraySomehow();
  // 传入一个合适的 MIME 类型
  var blob = new Blob([typeArray.buffer], {type: 'application/octet-stream'});
  var url = URL.creatObjectURL(blob);
  // 会产生一个类似 blob:d3958f5c-0777-0845-9dcf-2cb28783acaf 这样的 URL 字符串
  // 你可以像使用普通的 URL 那样使用它，比如用在 img.src 上
#+END_SRC

_3. 从 Blob 中提取数据_

一种从 Blob 中读取内容的方法是使用 =FileReader= ，以下代码将 Blob 的内容作为类型数组读取：

#+BEGIN_SRC js -n
  var reader = new FileReader();
  reader.addEventListener("loadend", function() {
      // reader.result 包含被转化为类型数组 typed array 的 blob
  })
  reader.readAsArrayBuffer(blob);
#+END_SRC

另一种读取 Blob 中内容的方式是使用 Response 对象，下述代码将 Blob 中的内容读取为文本：

#+BEGIN_SRC js -n
  var text = await (new Response(blob)).text();
#+END_SRC

通过使用 =FileReader= 的其它方法可以把 Blob 读取为字符串或者数据 URL 。

** File[fn:2]

文件（ =File= ）接口提供有关文件的信息，并允许网页中的 JavaScript 访问其内容。

通常情况下，File 对象是来自用户在一个 =<input>= 元素上选择文件后返回的 =FileList= 对象，也可以是来自由拖放操作生成的 =DataTransfer= 对象，或者来自 =HTMLCanvasElement= 上的 =mozGetAsFile()= API 。

File 对象是特殊类型的 =Blob= ，且可以用在任意的 Blob 类型的 context 中。比如说， =FileReader, URL.createObjectURL(), createImageBitmap()= 及 =XMLHttpRequest.send()= 都能处理 Blob 和 File 。

** Base64[fn:3]

Base64 是一组相似的二进制到文本（binary-to-text）的 *编码规则* ，使得二进制数据在解释成 radix-64 的表现形式后能够用 ASCII 字符串的格式表示出来。

#+BEGIN_EXPORT html
<note>
Base64 这个词出自一种 MIME 数据传输编码。
</note>
#+END_EXPORT

Base64 编码普遍应用于需要通过被设计为处理文本数据的媒介上储存和传输二进制数据而需要编码该二进制数据的场景，这样是为了保证数据的完整并且不用在传输过程中修改这些数据。

在 JavaScript 中，有两个函数被分别用来解码和编码 base64 字符串： =atob()= 和 =btoa()= 。

=atob()= 函数能够解码通过 base-64 编码的字符串数据，相反地， =btoa()= 函数能够从二进制数据字符串创建一个 base-64 编码的 ASCII 字符串。

#+BEGIN_SRC js -n
  // atob() 将 base64 解码
  // btoa() 将 字符串转码为 base64
  var str = 'javascript'
  window.btoa(str)                // 转码 → amF2YXNjcmlwdA==
  window.atob('amF2YXNjcmlwdA==') // 解码 → javascript

  // 中方需要先用 encodeURIComponent 和 decodeURIComponent 转/解码

#+END_SRC

*编码尺寸增加* ，每一个 Base64 字符串实际上代表着 6 比特位，因此，3 字节（1字节是 8 比特，3字节为 24 比特）的字符串/二进制文件可以转换成 4 个 Base64 字符（4 * 6 = 24 比特）。

这意味着 Base64 格式的字符串或文件的尺寸是原始尺寸的 133% ，如果编码的数据很少，增加的比例可能会更高。

#+BEGIN_EXPORT html
<essay>
是不是有些混乱？Hmm... 来看下百度百科吧。
</essay>
#+END_EXPORT

#+BEGIN_QUOTE
Base64 要求把每三个 8bit 的字节转换为四个 6bit 的字节（3*8 = 4*6 = 24），然后把 6bit 再添加两位高位 0 ，组成四个 8bit 的字节，也就是说，转换后的字符串理论上将要比原来的长 1/3 。
#+END_QUOTE

其具规则如下[fn:5]：

#+BEGIN_EXAMPLE
1. 把 3 个字节变成 4 个字节
2. 每 76 个字符加一个换行符
3. 最后的结束符也要处理
#+END_EXAMPLE

下面来看一个具体的例子。

#+BEGIN_EXAMPLE
转换前： 10101101,10111010,01110110
等价于：   101011   01,1011   1010,01  110110
转换后： 00101011,00011011 ,00101001,00110110
十进制： 43       27        41       54

对照 =Table 1: The Base64 Alphabet= 码表：
         r        b         p        2
#+END_EXAMPLE

如上，上面的 24 位编码后的 Base64 值为 =rbp2= 。解码同理，把 =rbp2= 的二进制位连接上再重组得到的 8 位值，得出原码。

