public/file-conversion.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-01-01 Fri 12:32 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>File Conversion</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jack Liu">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" type="text/css" href="/dist/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">File Conversion</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga5b4446">Blob</a></li>
<li><a href="#orgfad1f55">File</a></li>
<li><a href="#orge5bfb2d">Base64</a></li>
<li><a href="#org5f0d785">FormData</a></li>
<li><a href="#orgcca6d95">转换</a>
<ul>
<li><a href="#org884123b">fileToBase64</a></li>
<li><a href="#org77d9f57">fileToBlob</a></li>
<li><a href="#orgc1d80e2">base64ToFile</a></li>
<li><a href="#org6496f0d">base64ToBlob</a></li>
<li><a href="#org69ed789">blobToFile</a></li>
<li><a href="#org93a0eff">blobToBase64</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
JavaScript 中的 file、blob 和 base64 。
</p>

<div id="outline-container-orga5b4446" class="outline-2">
<h2 id="orga5b4446">Blob<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h2>
<div class="outline-text-2" id="text-orga5b4446">
<p>
Blob 对象表示一个不可变、原始数据的 <span class="underline">类文件对象</span> ，它的数据可以按文本或二进制的格式进行读取，也可以转换成 <code>ReadableStream</code> 来用于数据操作。
</p>

<p>
Blob 表示的不一定是 JavaScript 原生格式的数据。 <code>File</code> 接口基于 Blob，继承了 blob 的功能并将其扩展，使其支持用户系统上的文件。
</p>

<p>
要从其他非 blob 对象和数据构造一个 Blob ，请使用 <code>Blob()</code> 函数；要创建一个 blob 数据的子集 blob ，请使用 <code>slice()</code> 方法；要获取用户文件系统上的文件对应的 Blob 对象，请参阅 <code>File</code> 文档。
</p>

<p>
接受 Blob 对象的 API 也被列在 <code>File</code> 文档中。
</p>

<p>
<span class="underline">1. Blob() 构造函数</span>
</p>

<p>
<code>Blob()</code> 构造函数允许通过其它对象创建 Blob 对象，比如，用字符串构建一个 blob ：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">obj</span> = <span style="color: #AE81FF;">{</span>name: <span style="color: #E6DB74;">'Jack Liu'</span><span style="color: #AE81FF;">}</span>;
<span class="linenr">2: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">blob</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Blob</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span>JSON.stringify<span style="color: #A6E22E;">(</span>obj<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">]</span>, <span style="color: #66D9EF;">{</span>type: <span style="color: #E6DB74;">'application/json'</span><span style="color: #66D9EF;">}</span><span style="color: #AE81FF;">)</span>;
</pre>
</div>

<p>
<span class="underline">2. 使用 Blob 创建一个指向类型化数组的 URL</span>
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">typeArray</span> = GetTheTypedArraySomehow<span style="color: #AE81FF;">()</span>;
<span class="linenr">2: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">&#20256;&#20837;&#19968;&#20010;&#21512;&#36866;&#30340; MIME &#31867;&#22411;</span>
<span class="linenr">3: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">blob</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Blob</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">[</span>typeArray.buffer<span style="color: #66D9EF;">]</span>, <span style="color: #66D9EF;">{</span>type: <span style="color: #E6DB74;">'application/octet-stream'</span><span style="color: #66D9EF;">}</span><span style="color: #AE81FF;">)</span>;
<span class="linenr">4: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">url</span> = URL.creatObjectURL<span style="color: #AE81FF;">(</span>blob<span style="color: #AE81FF;">)</span>;
<span class="linenr">5: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">&#20250;&#20135;&#29983;&#19968;&#20010;&#31867;&#20284; blob:d3958f5c-0777-0845-9dcf-2cb28783acaf &#36825;&#26679;&#30340; URL &#23383;&#31526;&#20018;</span>
<span class="linenr">6: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">&#20320;&#21487;&#20197;&#20687;&#20351;&#29992;&#26222;&#36890;&#30340; URL &#37027;&#26679;&#20351;&#29992;&#23427;&#65292;&#27604;&#22914;&#29992;&#22312; img.src &#19978;</span>
</pre>
</div>

<p>
<span class="underline">3. 从 Blob 中提取数据</span>
</p>

<p>
一种从 Blob 中读取内容的方法是使用 <code>FileReader</code> ，以下代码将 Blob 的内容作为类型数组读取：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">reader</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">FileReader</span><span style="color: #AE81FF;">()</span>;
<span class="linenr">2: </span>reader.addEventListener<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">"loadend"</span>, <span style="color: #F92672;">function</span><span style="color: #66D9EF;">()</span> <span style="color: #66D9EF;">{</span>
<span class="linenr">3: </span>    <span style="color: #75715E;">// </span><span style="color: #75715E;">reader.result &#21253;&#21547;&#34987;&#36716;&#21270;&#20026;&#31867;&#22411;&#25968;&#32452; typed array &#30340; blob</span>
<span class="linenr">4: </span><span style="color: #66D9EF;">}</span><span style="color: #AE81FF;">)</span>
<span class="linenr">5: </span>reader.readAsArrayBuffer<span style="color: #AE81FF;">(</span>blob<span style="color: #AE81FF;">)</span>;
</pre>
</div>

<p>
另一种读取 Blob 中内容的方式是使用 Response 对象，下述代码将 Blob 中的内容读取为文本：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">text</span> = <span style="color: #F92672;">await</span> <span style="color: #AE81FF;">(</span><span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Response</span><span style="color: #66D9EF;">(</span>blob<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>.text<span style="color: #AE81FF;">()</span>;
</pre>
</div>

<p>
通过使用 <code>FileReader</code> 的其它方法可以把 Blob 读取为字符串或者数据 URL 。
</p>
</div>
</div>

<div id="outline-container-orgfad1f55" class="outline-2">
<h2 id="orgfad1f55">File<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-orgfad1f55">
<p>
文件（ <code>File</code> ）接口提供有关文件的信息，并允许网页中的 JavaScript 访问其内容。
</p>

<p>
通常情况下，File 对象是来自用户在一个 <code>&lt;input&gt;</code> 元素上选择文件后返回的 <code>FileList</code> 对象，也可以是来自由拖放操作生成的 <code>DataTransfer</code> 对象，或者来自 <code>HTMLCanvasElement</code> 上的 <code>mozGetAsFile()</code> API 。
</p>

<p>
File 对象是特殊类型的 <code>Blob</code> ，且可以用在任意的 Blob 类型的 context 中。比如说， <code>FileReader, URL.createObjectURL(), createImageBitmap()</code> 及 <code>XMLHttpRequest.send()</code> 都能处理 Blob 和 File 。
</p>
</div>
</div>

<div id="outline-container-orge5bfb2d" class="outline-2">
<h2 id="orge5bfb2d">Base64<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></h2>
<div class="outline-text-2" id="text-orge5bfb2d">
<p>
Base64 是一组相似的二进制到文本（binary-to-text）的 <b>编码规则</b> ，使得二进制数据在解释成 radix-64 的表现形式后能够用 ASCII 字符串的格式表示出来。
</p>

<note>
Base64 这个词出自一种 MIME 数据传输编码。
</note>

<p>
Base64 编码普遍应用于需要通过被设计为处理文本数据的媒介上储存和传输二进制数据而需要编码该二进制数据的场景，这样是为了保证数据的完整并且不用在传输过程中修改这些数据。
</p>

<p>
在 JavaScript 中，有两个函数被分别用来解码和编码 base64 字符串： <code>atob()</code> 和 <code>btoa()</code> 。
</p>

<p>
<code>atob()</code> 函数能够解码通过 base-64 编码的字符串数据，相反地， <code>btoa()</code> 函数能够从二进制数据字符串创建一个 base-64 编码的 ASCII 字符串。
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">atob() &#23558; base64 &#35299;&#30721;</span>
<span class="linenr">2: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">btoa() &#23558; &#23383;&#31526;&#20018;&#36716;&#30721;&#20026; base64</span>
<span class="linenr">3: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">str</span> = <span style="color: #E6DB74;">'javascript'</span>
<span class="linenr">4: </span>window.btoa<span style="color: #AE81FF;">(</span>str<span style="color: #AE81FF;">)</span>                <span style="color: #75715E;">// </span><span style="color: #75715E;">&#36716;&#30721; &#8594; amF2YXNjcmlwdA==</span>
<span class="linenr">5: </span>window.atob<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'amF2YXNjcmlwdA=='</span><span style="color: #AE81FF;">)</span> <span style="color: #75715E;">// </span><span style="color: #75715E;">&#35299;&#30721; &#8594; javascript</span>
<span class="linenr">6: </span>
<span class="linenr">7: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">&#20013;&#26041;&#38656;&#35201;&#20808;&#29992; encodeURIComponent &#21644; decodeURIComponent &#36716;/&#35299;&#30721;</span>
<span class="linenr">8: </span>
</pre>
</div>

<p>
<b>编码尺寸增加</b> ，每一个 Base64 字符串实际上代表着 6 比特位，因此，3 字节（1字节是 8 比特，3字节为 24 比特）的字符串/二进制文件可以转换成 4 个 Base64 字符（4 * 6 = 24 比特）。
</p>

<p>
这意味着 Base64 格式的字符串或文件的尺寸是原始尺寸的 133% ，如果编码的数据很少，增加的比例可能会更高。
</p>

<essay>
是不是有些混乱？Hmm... 来看下百度百科吧。
</essay>

<blockquote>
<p>
Base64 要求把每三个 8bit 的字节转换为四个 6bit 的字节（3*8 = 4*6 = 24），然后把 6bit 再添加两位高位 0 ，组成四个 8bit 的字节，也就是说，转换后的字符串理论上将要比原来的长 1/3 。
</p>
</blockquote>

<p>
其具规则如下<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>：
</p>

<pre class="example">
1. 把 3 个字节变成 4 个字节
2. 每 76 个字符加一个换行符
3. 最后的结束符也要处理
</pre>

<p>
下面来看一个具体的例子。
</p>

<pre class="example">
转换前： 10101101,10111010,01110110
等价于：   101011   01,1011   1010,01  110110
转换后： 00101011,00011011 ,00101001,00110110
十进制： 43       27        41       54

对照 =Table 1: The Base64 Alphabet= 码表：
         r        b         p        2
</pre>

<p>
如上，上面的 24 位编码后的 Base64 值为 <code>rbp2</code> 。解码同理，把 <code>rbp2</code> 的二进制位连接上再重组得到的 8 位值，得出原码。
</p>
</div>
</div>
