org/file-conversion.org
** FormData

FormData 接口提供了一种表示表单数据的键值 =key/value= 的构造方式，并且可以轻松地将数据通过 =XMLHttpRequest.send()= 方法发送出去。如果送出时的编码类型被设为 =multipart/form-data= ，它会使用和表单一样的格式。

实现了 FormData 接口的对象可以直接在 =for...of= 结构中使用，而不需要调用 =entries()= ： =for(var p of myFormData)= 的作用和 =for(var p of myFormData.entries())= 是相同的。

=FormData()= 构造函数用来创建一个新的 FormData 对象。

#+BEGIN_EXPORT html
<essay>
有时候，这种“参考书式的定义”真的让人很……
</essay>
#+END_EXPORT

*FormData 有会么用呢？*

FormData 类型是在 XMLHttpRequest 2 级定义的，它是为序列化表单以及创建与表单格式相同的数据提供便利（用于 XHR 传输）。

_1. 序列化表单_

将 form 表单元素的 =name= 与 =value= 进行组合，实现表单数据的序列化，从而减少表单元素的拼接，提高工作效率。

#+BEGIN_SRC html -n
  <form id="myForm" method="post" action="">
    <input name="name" type="text" value="jack" />
    <input name="pswd" type="password" value="12345678" />
    <input type="submit" value="提交" />
  </form>
#+END_SRC

我们可以使用这个表单元素作为初始化参数，来实例化一个 FormData 对象。

#+BEGIN_SRC js -n
  // 1. 获取页面已有的一个 form 表单
  var myForm = document.getElementById('myForm')
  // 2. 用表单来初始化
  var formData = new FormData(form)

  // 我们可以根据 name 来访问表单中的字段
  var name = formData.get('name') // → jack
  var pswd = formData.get('pswd') // → 12345678

  // 当然，我们也可以在此基础上添加其他数据
  formData.append('token', 'fajskd.fj23jkf.sdfk')

  // 你还可以通过 xhr 来发送数据
  var xhr = new XMLHttpRequest()
  xhr.open('post', 'http://127.0.0.1/login')
  xhr.setHeader('Content-Type', 'application/x-www-form-urlencoded')
  xhr.send(formData)
  xhr.onload = function() {
      if (xhr.status === 200) {
          // ...
      }
  }
#+END_SRC

_2. 直接创建一个 FormData 对象_

使用 =FormData= 构造函数可以直接创建一个 FormData 对象，如： =var formData = new FormData()= ，然后，就可以调用相关方法进行操作。

_3. 常用方法_

#+BEGIN_EXPORT html
<essay>
无非是“增删查改”那些事儿……
</essay>
#+END_EXPORT

| 方法                 | 描述                                                                                |
|----------------------+-------------------------------------------------------------------------------------|
| =append(key, value)= | 向 FormData 中添加新的属性值，对应的属性值存在也不会覆盖                            |
| =get(key)=           | 返回在 FormData 对象中与给定键关联的第一个值                                        |
| =getAll(key)=        | 返回一个包含 FormData 对象中与给定键关联的所有值的数组                              |
| =has(key)=           | 返回一个布尔值表明 FormData 对象是否包含某些键                                      |
| =set(key, value)=    | 给 FormData 设置属性值，如果FormData 对应的属性值存在则覆盖原值，否则新增一项属性值 |
| =entries=            | 返回一个包含所有键值对的 iterator 对象                                              |
| =keys=               | 返回一个包含所有键的 iterator 对象                                                  |
| =values=             | 返回一个包含所有值的 iterator 对象                                                  |
| =delete(key)=        | 从 FormData 对象里面删除一个键值对                                                  |

** 转换[fn:4]

*** fileToBase64

主要应用场景：图片预览。

#+BEGIN_SRC js -n
  function fileToBase64(file, callback) {
      var reader = new FileReader()
      reader.readAsDataURL(file)
      reader.onload = function(e) {
          var base64 = e.target.result

          if (typeof callback === 'function') {
              callback(base64)

          } else {
              console.log('base64: ', base64)
          }
      }
  }
#+END_SRC

