public/file-conversion.html

<div id="outline-container-org5f0d785" class="outline-2">
<h2 id="org5f0d785">FormData</h2>
<div class="outline-text-2" id="text-org5f0d785">
<p>
FormData 接口提供了一种表示表单数据的键值 <code>key/value</code> 的构造方式，并且可以轻松地将数据通过 <code>XMLHttpRequest.send()</code> 方法发送出去。如果送出时的编码类型被设为 <code>multipart/form-data</code> ，它会使用和表单一样的格式。
</p>

<p>
实现了 FormData 接口的对象可以直接在 <code>for...of</code> 结构中使用，而不需要调用 <code>entries()</code> ： <code>for(var p of myFormData)</code> 的作用和 <code>for(var p of myFormData.entries())</code> 是相同的。
</p>

<p>
<code>FormData()</code> 构造函数用来创建一个新的 FormData 对象。
</p>

<essay>
有时候，这种“参考书式的定义”真的让人很……
</essay>

<p>
<b>FormData 有会么用呢？</b>
</p>

<p>
FormData 类型是在 XMLHttpRequest 2 级定义的，它是为序列化表单以及创建与表单格式相同的数据提供便利（用于 XHR 传输）。
</p>

<p>
<span class="underline">1. 序列化表单</span>
</p>

<p>
将 form 表单元素的 <code>name</code> 与 <code>value</code> 进行组合，实现表单数据的序列化，从而减少表单元素的拼接，提高工作效率。
</p>

<div class="org-src-container">
<pre class="src src-html"><span class="linenr">1: </span>&lt;<span style="color: #A6E22E;">form</span> <span style="color: #FD971F;">id</span>=<span style="color: #E6DB74;">"myForm"</span> <span style="color: #FD971F;">method</span>=<span style="color: #E6DB74;">"post"</span> <span style="color: #FD971F;">action</span>=<span style="color: #E6DB74;">""</span>&gt;
<span class="linenr">2: </span>  &lt;<span style="color: #A6E22E;">input</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"name"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"text"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"jack"</span> /&gt;
<span class="linenr">3: </span>  &lt;<span style="color: #A6E22E;">input</span> <span style="color: #FD971F;">name</span>=<span style="color: #E6DB74;">"pswd"</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"password"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"12345678"</span> /&gt;
<span class="linenr">4: </span>  &lt;<span style="color: #A6E22E;">input</span> <span style="color: #FD971F;">type</span>=<span style="color: #E6DB74;">"submit"</span> <span style="color: #FD971F;">value</span>=<span style="color: #E6DB74;">"&#25552;&#20132;"</span> /&gt;
<span class="linenr">5: </span>&lt;/<span style="color: #A6E22E;">form</span>&gt;
</pre>
</div>

<p>
我们可以使用这个表单元素作为初始化参数，来实例化一个 FormData 对象。
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">1. &#33719;&#21462;&#39029;&#38754;&#24050;&#26377;&#30340;&#19968;&#20010; form &#34920;&#21333;</span>
<span class="linenr"> 2: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">myForm</span> = document.getElementById<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'myForm'</span><span style="color: #AE81FF;">)</span>
<span class="linenr"> 3: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">2. &#29992;&#34920;&#21333;&#26469;&#21021;&#22987;&#21270;</span>
<span class="linenr"> 4: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">formData</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">FormData</span><span style="color: #AE81FF;">(</span>form<span style="color: #AE81FF;">)</span>
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">&#25105;&#20204;&#21487;&#20197;&#26681;&#25454; name &#26469;&#35775;&#38382;&#34920;&#21333;&#20013;&#30340;&#23383;&#27573;</span>
<span class="linenr"> 7: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">name</span> = formData.get<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'name'</span><span style="color: #AE81FF;">)</span> <span style="color: #75715E;">// </span><span style="color: #75715E;">&#8594; jack</span>
<span class="linenr"> 8: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">pswd</span> = formData.get<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'pswd'</span><span style="color: #AE81FF;">)</span> <span style="color: #75715E;">// </span><span style="color: #75715E;">&#8594; 12345678</span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">&#24403;&#28982;&#65292;&#25105;&#20204;&#20063;&#21487;&#20197;&#22312;&#27492;&#22522;&#30784;&#19978;&#28155;&#21152;&#20854;&#20182;&#25968;&#25454;</span>
<span class="linenr">11: </span>formData.append<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'token'</span>, <span style="color: #E6DB74;">'fajskd.fj23jkf.sdfk'</span><span style="color: #AE81FF;">)</span>
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">&#20320;&#36824;&#21487;&#20197;&#36890;&#36807; xhr &#26469;&#21457;&#36865;&#25968;&#25454;</span>
<span class="linenr">14: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">xhr</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">XMLHttpRequest</span><span style="color: #AE81FF;">()</span>
<span class="linenr">15: </span>xhr.open<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'post'</span>, <span style="color: #E6DB74;">'http://127.0.0.1/login'</span><span style="color: #AE81FF;">)</span>
<span class="linenr">16: </span>xhr.setHeader<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'Content-Type'</span>, <span style="color: #E6DB74;">'application/x-www-form-urlencoded'</span><span style="color: #AE81FF;">)</span>
<span class="linenr">17: </span>xhr.send<span style="color: #AE81FF;">(</span>formData<span style="color: #AE81FF;">)</span>
<span class="linenr">18: </span>xhr.onload = <span style="color: #F92672;">function</span><span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
<span class="linenr">19: </span>    <span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span>xhr.status === 200<span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
<span class="linenr">20: </span>        <span style="color: #75715E;">// </span><span style="color: #75715E;">...</span>
<span class="linenr">21: </span>    <span style="color: #66D9EF;">}</span>
<span class="linenr">22: </span><span style="color: #AE81FF;">}</span>
</pre>
</div>

<p>
<span class="underline">2. 直接创建一个 FormData 对象</span>
</p>

<p>
使用 <code>FormData</code> 构造函数可以直接创建一个 FormData 对象，如： <code>var formData = new FormData()</code> ，然后，就可以调用相关方法进行操作。
</p>

<p>
<span class="underline">3. 常用方法</span>
</p>

<essay>
无非是“增删查改”那些事儿……
</essay>

<table>

<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">方法</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>append(key, value)</code></td>
<td class="org-left">向 FormData 中添加新的属性值，对应的属性值存在也不会覆盖</td>
</tr>

<tr>
<td class="org-left"><code>get(key)</code></td>
<td class="org-left">返回在 FormData 对象中与给定键关联的第一个值</td>
</tr>

<tr>
<td class="org-left"><code>getAll(key)</code></td>
<td class="org-left">返回一个包含 FormData 对象中与给定键关联的所有值的数组</td>
</tr>

<tr>
<td class="org-left"><code>has(key)</code></td>
<td class="org-left">返回一个布尔值表明 FormData 对象是否包含某些键</td>
</tr>

<tr>
<td class="org-left"><code>set(key, value)</code></td>
<td class="org-left">给 FormData 设置属性值，如果FormData 对应的属性值存在则覆盖原值，否则新增一项属性值</td>
</tr>

<tr>
<td class="org-left"><code>entries</code></td>
<td class="org-left">返回一个包含所有键值对的 iterator 对象</td>
</tr>

<tr>
<td class="org-left"><code>keys</code></td>
<td class="org-left">返回一个包含所有键的 iterator 对象</td>
</tr>

<tr>
<td class="org-left"><code>values</code></td>
<td class="org-left">返回一个包含所有值的 iterator 对象</td>
</tr>

<tr>
<td class="org-left"><code>delete(key)</code></td>
<td class="org-left">从 FormData 对象里面删除一个键值对</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgcca6d95" class="outline-2">
<h2 id="orgcca6d95">转换<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup></h2>
<div class="outline-text-2" id="text-orgcca6d95">
</div>
<div id="outline-container-org884123b" class="outline-3">
<h3 id="org884123b">fileToBase64</h3>
<div class="outline-text-3" id="text-org884123b">
<p>
主要应用场景：图片预览。
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">fileToBase64</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">file</span>, <span style="color: #FD971F;">callback</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
<span class="linenr"> 2: </span>    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">reader</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">FileReader</span><span style="color: #66D9EF;">()</span>
<span class="linenr"> 3: </span>    reader.readAsDataURL<span style="color: #66D9EF;">(</span>file<span style="color: #66D9EF;">)</span>
<span class="linenr"> 4: </span>    reader.onload = <span style="color: #F92672;">function</span><span style="color: #66D9EF;">(</span><span style="color: #FD971F;">e</span><span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
<span class="linenr"> 5: </span>        <span style="color: #F92672;">var</span> <span style="color: #FD971F;">base64</span> = e.target.result
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>        <span style="color: #F92672;">if</span> <span style="color: #A6E22E;">(</span><span style="color: #F92672;">typeof</span> callback === <span style="color: #E6DB74;">'function'</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">{</span>
<span class="linenr"> 8: </span>            callback<span style="color: #E6DB74;">(</span>base64<span style="color: #E6DB74;">)</span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>        <span style="color: #A6E22E;">}</span> <span style="color: #F92672;">else</span> <span style="color: #A6E22E;">{</span>
<span class="linenr">11: </span>            console.log<span style="color: #E6DB74;">(</span><span style="color: #E6DB74;">'base64: '</span>, base64<span style="color: #E6DB74;">)</span>
<span class="linenr">12: </span>        <span style="color: #A6E22E;">}</span>
<span class="linenr">13: </span>    <span style="color: #66D9EF;">}</span>
<span class="linenr">14: </span><span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>
