org/file-conversion.org
*** fileToBlob

主要应用场景：文件上传。

#+BEGIN_SRC js -n
  function fileToBlob(file, callback) {
      var type = file.type
      var reader = new FileReader()
      reader.readAsDataURL(file)
      reader.onload = function(e) {
          var blob = new Blob([e.target.result], {type})

          if (typeof callback === 'function') {
              callback(blob)

          } else {
              console.log('blob: ', blob)
              return blob
          }
      }
  }
#+END_SRC

*** base64ToFile

主要应用场景：文件上传。

#+BEGIN_SRC js -n
  function base64ToFile(base64, callback(fileName)) {
      var arr = base64.split(','),
          type = arr[0].match(/:(.*?);/)[1],
          bstr = atob(arr[1]),
          n = bstr.length,
          u8arr = new Unit8Array(n)

      while(n--) {
          u8arr[n] = bstr.charCodeAt(n)
      }

      return new File([u8arr], fileName, {type})
  }
#+END_SRC

*** base64ToBlob

主要应用场景：文件上传。

#+BEGIN_SRC js -n
  //dataURL 类似为 data:img/jpg;base64,/9j/4AAQSkZJRgABAQEASABIAAD/2w...
  function base64ToBlob(base64, callback) {
      var arr = base64.split(','),
          // mimeString
          type = arr[0].match(/:(.*?);/)[1],
          // byteString
          bstr = atob(arr[1]),
          n = bstr.length,
          u8arr = new Uint8Array(n)

      // for (var i = 0; i < byteString.length; i++) {
      //     ia[i] = byteString.charCodeAt(i)
      // }

      while(n--) {
          u8arr[n] = bstr.charCodeAt(n)
      }

      return new Blob([u8arr], {type})
  }
#+END_SRC

*** blobToFile

主要应用场景：文件上传。

#+BEGIN_SRC js -n
  function blobToFile(blob, fileName) {
      var file = new File([blob], fileName, {type: blob.type})
      return file
  }
#+END_SRC

*** blobToBase64

主要应用场景：图片预览。

#+BEGIN_SRC js -n
  function blobToBase64(blob, callback) {
      var reader = new FileReader()
      reader.readAsDataURL(blob)
      reader.onload = function(e) {
          if (typeof callback === 'function') {
              callback(e.target.result)
          } else {
              console.log('base64: ', e.target.result)
              return e.target.result
          }
      }
  }
#+END_SRC

