public/file-conversion.html

<div id="outline-container-org77d9f57" class="outline-3">
<h3 id="org77d9f57">fileToBlob</h3>
<div class="outline-text-3" id="text-org77d9f57">
<p>
主要应用场景：文件上传。
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">fileToBlob</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">file</span>, <span style="color: #FD971F;">callback</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
<span class="linenr"> 2: </span>    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">type</span> = file.type
<span class="linenr"> 3: </span>    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">reader</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">FileReader</span><span style="color: #66D9EF;">()</span>
<span class="linenr"> 4: </span>    reader.readAsDataURL<span style="color: #66D9EF;">(</span>file<span style="color: #66D9EF;">)</span>
<span class="linenr"> 5: </span>    reader.onload = <span style="color: #F92672;">function</span><span style="color: #66D9EF;">(</span><span style="color: #FD971F;">e</span><span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
<span class="linenr"> 6: </span>        <span style="color: #F92672;">var</span> <span style="color: #FD971F;">blob</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Blob</span><span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">[</span>e.target.result<span style="color: #E6DB74;">]</span>, <span style="color: #E6DB74;">{</span>type<span style="color: #E6DB74;">}</span><span style="color: #A6E22E;">)</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>        <span style="color: #F92672;">if</span> <span style="color: #A6E22E;">(</span><span style="color: #F92672;">typeof</span> callback === <span style="color: #E6DB74;">'function'</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">{</span>
<span class="linenr"> 9: </span>            callback<span style="color: #E6DB74;">(</span>blob<span style="color: #E6DB74;">)</span>
<span class="linenr">10: </span>
<span class="linenr">11: </span>        <span style="color: #A6E22E;">}</span> <span style="color: #F92672;">else</span> <span style="color: #A6E22E;">{</span>
<span class="linenr">12: </span>            console.log<span style="color: #E6DB74;">(</span><span style="color: #E6DB74;">'blob: '</span>, blob<span style="color: #E6DB74;">)</span>
<span class="linenr">13: </span>            <span style="color: #F92672;">return</span> blob
<span class="linenr">14: </span>        <span style="color: #A6E22E;">}</span>
<span class="linenr">15: </span>    <span style="color: #66D9EF;">}</span>
<span class="linenr">16: </span><span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1d80e2" class="outline-3">
<h3 id="orgc1d80e2">base64ToFile</h3>
<div class="outline-text-3" id="text-orgc1d80e2">
<p>
主要应用场景：文件上传。
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">base64ToFile</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">base64</span>, <span style="color: #FD971F;">callback</span><span style="color: #66D9EF;">(</span><span style="color: #FD971F;">fileName</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
<span class="linenr"> 2: </span>    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">arr</span> = base64.split<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">','</span><span style="color: #66D9EF;">)</span>,
<span class="linenr"> 3: </span>        type = arr<span style="color: #66D9EF;">[</span>0<span style="color: #66D9EF;">]</span>.match<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">/:(.*?);/</span><span style="color: #66D9EF;">)[</span>1<span style="color: #66D9EF;">]</span>,
<span class="linenr"> 4: </span>        bstr = atob<span style="color: #66D9EF;">(</span>arr<span style="color: #A6E22E;">[</span>1<span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">)</span>,
<span class="linenr"> 5: </span>        n = bstr.length,
<span class="linenr"> 6: </span>        u8arr = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Unit8Array</span><span style="color: #66D9EF;">(</span>n<span style="color: #66D9EF;">)</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>    <span style="color: #F92672;">while</span><span style="color: #66D9EF;">(</span>n--<span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
<span class="linenr"> 9: </span>        u8arr<span style="color: #A6E22E;">[</span>n<span style="color: #A6E22E;">]</span> = bstr.charCodeAt<span style="color: #A6E22E;">(</span>n<span style="color: #A6E22E;">)</span>
<span class="linenr">10: </span>    <span style="color: #66D9EF;">}</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span>    <span style="color: #F92672;">return</span> <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">File</span><span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">[</span>u8arr<span style="color: #A6E22E;">]</span>, fileName, <span style="color: #A6E22E;">{</span>type<span style="color: #A6E22E;">}</span><span style="color: #66D9EF;">)</span>
<span class="linenr">13: </span><span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6496f0d" class="outline-3">
<h3 id="org6496f0d">base64ToBlob</h3>
<div class="outline-text-3" id="text-org6496f0d">
<p>
主要应用场景：文件上传。
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #75715E;">//</span><span style="color: #75715E;">dataURL &#31867;&#20284;&#20026; data:img/jpg;base64,/9j/4AAQSkZJRgABAQEASABIAAD/2w...</span>
<span class="linenr"> 2: </span><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">base64ToBlob</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">base64</span>, <span style="color: #FD971F;">callback</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
<span class="linenr"> 3: </span>    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">arr</span> = base64.split<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">','</span><span style="color: #66D9EF;">)</span>,
<span class="linenr"> 4: </span>        <span style="color: #75715E;">// </span><span style="color: #75715E;">mimeString</span>
<span class="linenr"> 5: </span>        type = arr<span style="color: #66D9EF;">[</span>0<span style="color: #66D9EF;">]</span>.match<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">/:(.*?);/</span><span style="color: #66D9EF;">)[</span>1<span style="color: #66D9EF;">]</span>,
<span class="linenr"> 6: </span>        <span style="color: #75715E;">// </span><span style="color: #75715E;">byteString</span>
<span class="linenr"> 7: </span>        bstr = atob<span style="color: #66D9EF;">(</span>arr<span style="color: #A6E22E;">[</span>1<span style="color: #A6E22E;">]</span><span style="color: #66D9EF;">)</span>,
<span class="linenr"> 8: </span>        n = bstr.length,
<span class="linenr"> 9: </span>        u8arr = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Uint8Array</span><span style="color: #66D9EF;">(</span>n<span style="color: #66D9EF;">)</span>
<span class="linenr">10: </span>
<span class="linenr">11: </span>    <span style="color: #75715E;">// </span><span style="color: #75715E;">for (var i = 0; i &lt; byteString.length; i++) {</span>
<span class="linenr">12: </span>    <span style="color: #75715E;">//     </span><span style="color: #75715E;">ia[i] = byteString.charCodeAt(i)</span>
<span class="linenr">13: </span>    <span style="color: #75715E;">// </span><span style="color: #75715E;">}</span>
<span class="linenr">14: </span>
<span class="linenr">15: </span>    <span style="color: #F92672;">while</span><span style="color: #66D9EF;">(</span>n--<span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
<span class="linenr">16: </span>        u8arr<span style="color: #A6E22E;">[</span>n<span style="color: #A6E22E;">]</span> = bstr.charCodeAt<span style="color: #A6E22E;">(</span>n<span style="color: #A6E22E;">)</span>
<span class="linenr">17: </span>    <span style="color: #66D9EF;">}</span>
<span class="linenr">18: </span>
<span class="linenr">19: </span>    <span style="color: #F92672;">return</span> <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">Blob</span><span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">[</span>u8arr<span style="color: #A6E22E;">]</span>, <span style="color: #A6E22E;">{</span>type<span style="color: #A6E22E;">}</span><span style="color: #66D9EF;">)</span>
<span class="linenr">20: </span><span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org69ed789" class="outline-3">
<h3 id="org69ed789">blobToFile</h3>
<div class="outline-text-3" id="text-org69ed789">
<p>
主要应用场景：文件上传。
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">blobToFile</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">blob</span>, <span style="color: #FD971F;">fileName</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
<span class="linenr">2: </span>    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">file</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">File</span><span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">[</span>blob<span style="color: #A6E22E;">]</span>, fileName, <span style="color: #A6E22E;">{</span>type: blob.type<span style="color: #A6E22E;">}</span><span style="color: #66D9EF;">)</span>
<span class="linenr">3: </span>    <span style="color: #F92672;">return</span> file
<span class="linenr">4: </span><span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org93a0eff" class="outline-3">
<h3 id="org93a0eff">blobToBase64</h3>
<div class="outline-text-3" id="text-org93a0eff">
<p>
主要应用场景：图片预览。
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">blobToBase64</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">blob</span>, <span style="color: #FD971F;">callback</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
<span class="linenr"> 2: </span>    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">reader</span> = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">FileReader</span><span style="color: #66D9EF;">()</span>
<span class="linenr"> 3: </span>    reader.readAsDataURL<span style="color: #66D9EF;">(</span>blob<span style="color: #66D9EF;">)</span>
<span class="linenr"> 4: </span>    reader.onload = <span style="color: #F92672;">function</span><span style="color: #66D9EF;">(</span><span style="color: #FD971F;">e</span><span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
<span class="linenr"> 5: </span>        <span style="color: #F92672;">if</span> <span style="color: #A6E22E;">(</span><span style="color: #F92672;">typeof</span> callback === <span style="color: #E6DB74;">'function'</span><span style="color: #A6E22E;">)</span> <span style="color: #A6E22E;">{</span>
<span class="linenr"> 6: </span>            callback<span style="color: #E6DB74;">(</span>e.target.result<span style="color: #E6DB74;">)</span>
<span class="linenr"> 7: </span>        <span style="color: #A6E22E;">}</span> <span style="color: #F92672;">else</span> <span style="color: #A6E22E;">{</span>
<span class="linenr"> 8: </span>            console.log<span style="color: #E6DB74;">(</span><span style="color: #E6DB74;">'base64: '</span>, e.target.result<span style="color: #E6DB74;">)</span>
<span class="linenr"> 9: </span>            <span style="color: #F92672;">return</span> e.target.result
<span class="linenr">10: </span>        <span style="color: #A6E22E;">}</span>
<span class="linenr">11: </span>    <span style="color: #66D9EF;">}</span>
<span class="linenr">12: </span><span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>
</div>
